KlausMu/esp32-fan-controller/src/config.h
/*
  Before changing anything in this file, consider to copy file "config_override_example.h" to file "config_override.h" and to do your changes there.
  Doing so, you will
  - keep your credentials secret
  - most likely never have conflicts with new versions of this file
  Any define in CAPITALS can be moved to "config_override.h".
  All defines having BOTH lowercase and uppercase MUST stay in "config.h". They define the mode the "esp32 fan controller" is running in.
*/

#ifndef __CONFIG_H__
#define __CONFIG_H__

#include <driver/gpio.h>
#include <esp32-hal-gpio.h>

// --- Begin: choose operation mode -------------------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------
// You have two ways to choose the operation mode:
// 1. either use one of the presets
// 2. or define every low level option manually
// Recommendation is to start with one of the presets.
// In both cases, after choosing the operation mode, go further down in this file to set additional settings needed for the chosen mode (unused options should be greyed out).

#define usePresets

#if defined(usePresets)
// --- Way 1 to choose the operation mode: choose one of the presets. All further options are automatically set -----------------------------
/* These are the presets:
   Fan mode: speed of the fan will be directly set, either via mqtt, via a touch display or both
   Climate mode: speed of the fan will be controlled by temperature. If actual temperature is higher than target temperature, fan runs at high speed.
     Of course, actual temperature can never be lower than the air temperature which is transported by the fan from "outside" to "inside".
     Actual temperature: the actual temperature can be measured by an BME280 or can be provided via mqtt
     Target temperature: the target temperature will be tried to reach. The target temmperate can be provided via mqtt, via a touch display or both.
*/
// --- Begin: list of presets. Choose exactly one. ---
#define fan_controlledByMQTT
//#define fan_controlledByTouch
//#define fan_controlledByMQTTandTouch
//#define climate_controlledByBME_targetByMQTT
//#define climate_controlledByBME_targetByTouch
//#define climate_controlledByBME_targetByMQTTandTouch
//#define climate_controlledByMQTT_targetByMQTT
//#define climate_controlledByMQTT_targetByMQTTandTouch
// --- End: list of presets --------------------------

// --- based on the preset, automatically define other options --------------
// --- normally you shouldn't change the next lines -------------------------
#if defined(climate_controlledByBME_targetByMQTT) || defined(climate_controlledByBME_targetByTouch) || defined(climate_controlledByBME_targetByMQTTandTouch) || defined(climate_controlledByMQTT_targetByMQTT) || defined(climate_controlledByMQTT_targetByMQTTandTouch)
  #define useAutomaticTemperatureControl
  #if defined(climate_controlledByBME_targetByMQTT) || defined(climate_controlledByBME_targetByTouch) || defined(climate_controlledByBME_targetByMQTTandTouch)
    #define setActualTemperatureViaBME280
    #define useTemperatureSensorBME280
  #endif
  #if defined(climate_controlledByMQTT_targetByMQTT) || defined(climate_controlledByMQTT_targetByMQTTandTouch)
    #define setActualTemperatureViaMQTT
  #endif
#endif
#if defined(fan_controlledByMQTT) || defined(fan_controlledByMQTTandTouch) || defined(climate_controlledByBME_targetByMQTT) || defined(climate_controlledByBME_targetByMQTTandTouch) || defined(climate_controlledByMQTT_targetByMQTT) || defined(climate_controlledByMQTT_targetByMQTTandTouch)
  #define useWIFI
  #define useMQTT
#endif
#if defined(fan_controlledByTouch) || defined(fan_controlledByMQTTandTouch) || defined(climate_controlledByBME_targetByTouch) || defined(climate_controlledByBME_targetByMQTTandTouch) || defined(climate_controlledByMQTT_targetByMQTTandTouch)
  #define useTFT
  #define DRIVER_ILI9341       // e.g. 2.8 inch touch panel, 320x240, used in AZ-Touch
  #define useTouch
#endif

#else
// --- Way 2 to choose the operation mode: manually define every low level option -----------------------------------------------------------
/*
Mode 1: pwm mode
directly setting fan speed via pwm signal
-> comment "useAutomaticTemperatureControl"

Mode 2: temperature controller mode
fan speed automatically increases if temperature is getting close to or higher than target temperature. Of course temperature can never get lower than air temperature of room
-> uncomment "useAutomaticTemperatureControl"
   -> choose "setActualTemperatureViaBME280"
      -> uncomment "useTemperatureSensorBME280"
      XOR "setActualTemperatureViaMQTT"

In both modes you have to have at least one of "useMQTT" and "useTouch", otherwise you cannot control the fan.

Everything else is optional.

First set mode, then go further down in this file to set other options needed for the chosen mode (unused options should be greyed out).

*/
// --- setting mode -------------------------------------------------------------------------------------------------------------------------
// #define useAutomaticTemperatureControl
  #ifdef useAutomaticTemperatureControl
    // --- choose how to set target temperature. Activate only one. --------------------------------------
    #define setActualTemperatureViaBME280
    // #define setActualTemperatureViaMQTT
  #endif
// #define useTemperatureSensorBME280
#define useWIFI
#define useMQTT
// #define useTFT
  #ifdef useTFT
    // --- choose which display to use. Activate only one. -----------------------------------------------
    // #define DRIVER_ILI9341       // 2.8 inch touch panel, 320x240, used in AZ-Touch
    #define DRIVER_ST7735        // 1.8 inch panel,       160x128
  #endif
// #define useTouch
#endif
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------
// --- End: choose operation mode ---------------------------------------------------------------------------------------------------------------------------------



