KlausMu/esp32-fan-controller/src/config.h
// --- Begin: additional settings ---------------------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------------------------------------------------
// Now, as the basic operation mode is chosen, you can define additional settings

// --- Home Assistant MQTT discovery --------------------------------------------------------------------------------------------------------
/* If you are using Home Assistant, you can activate auto discovery of the climate/fan and sensors.
   Please also see https://github.com/KlausMu/esp32-fan-controller/wiki/06-Home-Assistant
   If needed, e.g. if you are using more than one esp32 fan controller, please adjust mqtt settings further down in this file */
#if defined(useMQTT)
#define useHomeassistantMQTTDiscovery
#endif
#if defined(useHomeassistantMQTTDiscovery) && !defined(useMQTT)
static_assert(false, "You have to use \"#define useMQTT\" when having \"#define useHomeassistantMQTTDiscovery\"");
#endif

/* --- If you have a touch display, you can show a standbyButton or shutdownButton
   There are two kind of shutdown buttons:
   1. set the fan controller to standby
        - pwm is set to 0. Note: it is not guaranteed that fan stops if pwm is set to 0
        - display is turned off
        - you can get your fan controller back to normal mode via an mqtt message or if you touch the display
   2. Call an external http REST endpoint, which can trigger any action you want.
      The display of the fan controller simply shows a counter from 30 to 0 and expects something to happen (e.g. power should be turned off by external means).
      If nothing happens and counter reaches 0, the fan controller goes back to normal operation mode.
      For example you could define in Home Assistant an input button. In an automation you could:
        - shutdown a Raspberry Pi
        - turn a smart plug off, so that the Raspberry Pi, a 3D printer and the fan controller get powered off
*/

// #define useShutdownButton
#define useStandbyButton
#if defined(useStandbyButton) && defined(useShutdownButton)
static_assert(false, "You cannot have both \"#define useStandbyButton\" and \"#define useShutdownButton\"");
#endif

// --- fan specs ----------------------------------------------------------------------------------------------------------------------------
// fanPWM
#define PWMPIN               GPIO_NUM_17
#define PWMFREQ              25000
#define PWMCHANNEL           0
#define PWMRESOLUTION        8
#define FANMAXRPM            1500         // only used for showing at how many percent fan is running

// fanTacho
#define TACHOPIN                             GPIO_NUM_16
#define TACHOUPDATECYCLE                     1000 // how often tacho speed shall be determined, in milliseconds
#define NUMBEROFINTERRUPSINONESINGLEROTATION 2    // Number of interrupts ESP32 sees on tacho signal on a single fan rotation. All the fans I've seen trigger two interrups.

// --- automatic temperature control --------------------------------------------------------------------------------------------------------

// ifdef:  adaptive fan speed depending on actual temperature and target temperature
//         target temperature can be set via tft touch or via mqtt
//         needs "useTemperatureSensorBME280 defined"
// ifndef: fan speed (pwm) is directly set, no adaptive temperature control
//         you can set fan speed either via tft touch or via mqtt

#ifdef useAutomaticTemperatureControl
// initial target temperature on startup
#define INITIALTARGETTEMPERATURE 27.0
// Lowest pwm value the temperature controller should use to set fan speed. If you want the fan not to turn off, set a value so that fan always runs.
#define PWMMINIMUMVALUE            120
#else
// delta used when manually increasing or decreasing pwm
#define PWMSTEP                    10
#endif

// initial pwm fan speed on startup (0 <= value <= 255)
#define INITIALPWMVALUE            120

// sanity check
#if !defined(setActualTemperatureViaBME280) && !defined(setActualTemperatureViaMQTT) && defined(useAutomaticTemperatureControl)
static_assert(false, "You have to use \"#define setActualTemperatureViaBME280\" or \"#define setActualTemperatureViaMQTT\" when having \"#define useAutomaticTemperatureControl\"");
#endif
#if defined(setActualTemperatureViaBME280) && !defined(useTemperatureSensorBME280)
static_assert(false, "You have to use \"#define useTemperatureSensorBME280\" when having \"#define setActualTemperatureViaBME280\"");
#endif
#if defined(setActualTemperatureViaBME280) && defined(setActualTemperatureViaMQTT)
static_assert(false, "You cannot have both \"#define setActualTemperatureViaBME280\" and \"#define setActualTemperatureViaMQTT\"");
#endif

// --- temperature sensor BME280 ------------------------------------------------------------------------------------------------------------

#ifdef useTemperatureSensorBME280
// I2C pins used for BME280
#define I2C_SCL              GPIO_NUM_32 // GPIO_NUM_22 // GPIO_NUM_17
#define I2C_SDA              GPIO_NUM_33 // GPIO_NUM_21 // GPIO_NUM_16
#define I2C_FREQ        100000 // 400000
#define BME280_ADDR      0x76
// in order to calibrate BME280 at startup, provide here the height over sea level in meter at your location
#define HEIGHTOVERSEALEVELATYOURLOCATION 112.0
#endif

// --- wifi ---------------------------------------------------------------------------------------------------------------------------------

#ifdef useWIFI
#define WIFI_SSID     "YourWifiSSID"           // override it in file "config_override.h"
#define WIFI_PASSWORD "YourWifiPassword"       // override it in file "config_override.h"
//#define WIFI_KNOWN_APS_COUNT 2
//#define WIFI_KNOWN_APS \
//  { "00:11:22:33:44:55", "Your AP 2,4 GHz"}, \
//  { "66:77:88:99:AA:BB", "Your AP 5 GHz"}
#endif

// --- OTA Update ---------------------------------------------------------------------------------------------------------------------------
#define useOTAUpdate
// #define useOTA_RTOS     // not recommended because of additional 10K of heap space needed

