KlausMu/esp32-fan-controller/src/config.h
#if !defined(useWIFI) && defined(useOTAUpdate)
static_assert(false, "\"#define useOTAUpdate\" is only possible with \"#define useWIFI\"");
#endif
#if !defined(ESP32) && defined(useOTA_RTOS)
static_assert(false, "\"#define useOTA_RTOS\" is only possible with ESP32");
#endif
#if defined(useOTA_RTOS) && !defined(useOTAUpdate)
static_assert(false, "You cannot use \"#define useOTA_RTOS\" without \"#define useOTAUpdate\"");
#endif

#define useSerial
#define useTelnetStream

// --- mqtt ---------------------------------------------------------------------------------------------------------------------------------
/*
  ----- IMPORTANT -----
  ----- MORE THAN ONE INSTANCE OF THE ESP32 FAN CONTROLLER -----
  If you want to have more than one instance of the esp32 fan controller in your network, every instance has to have it's own unique mqtt topcics (and IDs and name in HA, if you are using HA)
  For this the define UNIQUE_DEVICE_FRIENDLYNAME and UNIQUE_DEVICE_NAME is used. You can keep it unchanged if you have only one instance in your network.
  Otherwise you can change it to e.g. "Fan Controller 2" and "esp32_fan_controller_2"
*/
#ifdef useMQTT
#define UNIQUE_DEVICE_FRIENDLYNAME "Fan Controller"       // override it in file "config_override.h"
#define UNIQUE_DEVICE_NAME         "esp32_fan_controller" // override it in file "config_override.h"

#define MQTT_SERVER            "IPAddressOfYourBroker"    // override it in file "config_override.h"
#define MQTT_SERVER_PORT       1883                       // override it in file "config_override.h"
#define MQTT_USER              ""                         // override it in file "config_override.h"
#define MQTT_PASS              ""                         // override it in file "config_override.h"
#define MQTT_CLIENTNAME        UNIQUE_DEVICE_NAME

/*
For understanding when "cmnd", "stat" and "tele" is used, have a look at how Tasmota is doing it.
https://tasmota.github.io/docs/MQTT
https://tasmota.github.io/docs/openHAB/
https://www.openhab.org/addons/bindings/mqtt.generic/
https://www.openhab.org/addons/bindings/mqtt/
https://community.openhab.org/t/itead-sonoff-switches-and-sockets-cheap-esp8266-wifi-mqtt-hardware/15024
for debugging:
mosquitto_sub -h localhost -t "esp32_fan_controller/#" -v
mosquitto_sub -h localhost -t "homeassistant/climate/esp32_fan_controller/#" -v
mosquitto_sub -h localhost -t "homeassistant/fan/esp32_fan_controller/#" -v
mosquitto_sub -h localhost -t "homeassistant/sensor/esp32_fan_controller/#" -v
*/

#define MQTTCMNDTARGETTEMP        UNIQUE_DEVICE_NAME "/cmnd/TARGETTEMP"
#define MQTTSTATTARGETTEMP        UNIQUE_DEVICE_NAME "/stat/TARGETTEMP"
#define MQTTCMNDACTUALTEMP        UNIQUE_DEVICE_NAME "/cmnd/ACTUALTEMP"
#define MQTTSTATACTUALTEMP        UNIQUE_DEVICE_NAME "/stat/ACTUALTEMP"
#define MQTTCMNDFANPWM            UNIQUE_DEVICE_NAME "/cmnd/FANPWM"
#define MQTTSTATFANPWM            UNIQUE_DEVICE_NAME "/stat/FANPWM"
// https://www.home-assistant.io/integrations/climate.mqtt/#mode_command_topic
// https://www.home-assistant.io/integrations/climate.mqtt/#mode_state_topic
// note: it is not guaranteed that fan stops if pwm is set to 0
#define MQTTCMNDFANMODE           UNIQUE_DEVICE_NAME "/cmnd/MODE"   // can be "off" and "fan_only"
#define MQTTSTATFANMODE           UNIQUE_DEVICE_NAME "/stat/MODE"
#define MQTTFANMODEOFFPAYLOAD     "off"
#define MQTTFANMODEFANONLYPAYLOAD "fan_only"

#if defined(useOTAUpdate)
#define MQTTCMNDOTA            UNIQUE_DEVICE_NAME "/cmnd/OTA"
#endif

#ifdef useTemperatureSensorBME280
#define MQTTTELESTATE1         UNIQUE_DEVICE_NAME "/tele/STATE1"
#endif
#define MQTTTELESTATE2         UNIQUE_DEVICE_NAME "/tele/STATE2"
#define MQTTTELESTATE3         UNIQUE_DEVICE_NAME "/tele/STATE3"
#define MQTTTELESTATE4         UNIQUE_DEVICE_NAME "/tele/STATE4"

#if defined(useHomeassistantMQTTDiscovery)
/* see
   https://www.home-assistant.io/integrations/mqtt
   https://www.home-assistant.io/integrations/mqtt/#mqtt-discovery
   https://www.home-assistant.io/integrations/mqtt/#discovery-messages
   https://www.home-assistant.io/integrations/mqtt/#birth-and-last-will-messages
*/
#define HASSSTATUSTOPIC                       "homeassistant/status"    // can be "online" and "offline"
#define HASSSTATUSONLINEPAYLOAD               "online"
#define HASSSTATUSOFFLINEPAYLOAD              "offline"
/*
   When HA sends status online, we have to resent the discovery. But we have to wait some seconds, otherwise HA will not recognize the mqtt messages.
   If you have HA running on a weak mini computer, you may have to increase the waiting time. Value is in ms.
   Remark: the whole discovery process will be done in the following order:
   discovery, delay(1000), status=online, delay(1000), all inital values
*/
#define WAITAFTERHAISONLINEUNTILDISCOVERYWILLBESENT   1000
#define HASSFANSTATUSTOPIC                    UNIQUE_DEVICE_NAME "/stat/STATUS" // can be "online" and "offline"

// The define HOMEASSISTANTDEVICE will be reused in all discovery payloads for the climate/fan and the sensors. Everything should be contained in the same device.
#define HOMEASSISTANTDEVICE                   "\"dev\":{\"name\":\"" UNIQUE_DEVICE_FRIENDLYNAME "\", \"model\":\"" UNIQUE_DEVICE_NAME "\", \"identifiers\":[\"" UNIQUE_DEVICE_NAME "\"], \"manufacturer\":\"KlausMu\"}"

// climate
// see https://www.home-assistant.io/integrations/climate.mqtt/
#ifdef useAutomaticTemperatureControl
#define HASSCLIMATEDISCOVERYTOPIC             "homeassistant/climate/" UNIQUE_DEVICE_NAME "/config"
#ifdef useTemperatureSensorBME280
#define CURRENTHUMIDITYINCLIMATE              "\"current_humidity_topic\":\"~/tele/STATE1\", \"current_humidity_template\":\"{{value_json.hum | round(0)}}\", "
#else
#define CURRENTHUMIDITYINCLIMATE
#endif
#define HASSCLIMATEDISCOVERYPAYLOAD           "{\"name\":null,            \"unique_id\":\"" UNIQUE_DEVICE_NAME "\",             \"object_id\":\"" UNIQUE_DEVICE_NAME "\",             \"~\":\"" UNIQUE_DEVICE_NAME "\", \"icon\":\"mdi:fan\", \"min_temp\":10, \"max_temp\":50, \"temp_step\":1, \"precision\":0.1, " CURRENTHUMIDITYINCLIMATE "\"current_temperature_topic\":\"~/stat/ACTUALTEMP\", \"temperature_command_topic\":\"~/cmnd/TARGETTEMP\", \"temperature_state_topic\":\"~/stat/TARGETTEMP\", \"modes\":[\"off\",\"fan_only\"], \"mode_command_topic\":\"~/cmnd/MODE\", \"mode_state_topic\":\"~/stat/MODE\", \"availability_topic\":\"~/stat/STATUS\", " HOMEASSISTANTDEVICE "}"
#endif

