KlausMu/esp32-fan-controller/src/config.h
// fan
// see https://www.home-assistant.io/integrations/fan.mqtt/
#ifndef useAutomaticTemperatureControl
#define HASSFANDISCOVERYTOPIC                 "homeassistant/fan/" UNIQUE_DEVICE_NAME "/config"
#define HASSFANDISCOVERYPAYLOAD               "{\"name\":null,            \"unique_id\":\"" UNIQUE_DEVICE_NAME "\",             \"object_id\":\"" UNIQUE_DEVICE_NAME "\",             \"~\":\"" UNIQUE_DEVICE_NAME "\", \"icon\":\"mdi:fan\", \"command_topic\":\"~/cmnd/MODE\", \"state_topic\":\"~/stat/MODE\", \"payload_on\": \"fan_only\", \"payload_off\": \"off\", \"percentage_state_topic\": \"~/stat/FANPWM\", \"percentage_command_topic\": \"~/cmnd/FANPWM\", \"speed_range_min\": 1, \"speed_range_max\": 255,\"availability_topic\":\"~/stat/STATUS\", " HOMEASSISTANTDEVICE "}"
#endif

// sensors
// see https://www.home-assistant.io/integrations/sensor.mqtt/
#ifdef useTemperatureSensorBME280
#define HASSHUMIDITYSENSORDISCOVERYTOPIC      "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/humidity/config"
#define HASSHUMIDITYSENSORDISCOVERYPAYLOAD    "{\"name\":\"Humidity\",    \"unique_id\":\"" UNIQUE_DEVICE_NAME "_humidity\",    \"object_id\":\"" UNIQUE_DEVICE_NAME "_humidity\",    \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE1\", \"value_template\":\"{{ value_json.hum     | round(0) }}\", \"device_class\":\"humidity\",             \"unit_of_measurement\":\"%\",   \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"
#define HASSTEMPERATURESENSORDISCOVERYTOPIC   "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/temperature/config"
#define HASSTEMPERATURESENSORDISCOVERYPAYLOAD "{\"name\":\"Temperature\", \"unique_id\":\"" UNIQUE_DEVICE_NAME "_temperature\", \"object_id\":\"" UNIQUE_DEVICE_NAME "_temperature\", \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE1\", \"value_template\":\"{{ value_json.ActTemp | round(1) }}\", \"device_class\":\"temperature\",          \"unit_of_measurement\":\"°C\",  \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"
#define HASSPRESSURESENSORDISCOVERYTOPIC      "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/pressure/config"
#define HASSPRESSURESENSORDISCOVERYPAYLOAD    "{\"name\":\"Pressure\",    \"unique_id\":\"" UNIQUE_DEVICE_NAME "_pressure\",    \"object_id\":\"" UNIQUE_DEVICE_NAME "_pressure\",    \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE1\", \"value_template\":\"{{ value_json.pres    | round(0) }}\", \"device_class\":\"atmospheric_pressure\", \"unit_of_measurement\":\"hPa\", \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"
#define HASSALTITUDESENSORDISCOVERYTOPIC      "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/altitude/config"
#define HASSALTITUDESENSORDISCOVERYPAYLOAD    "{\"name\":\"Altitude\",    \"unique_id\":\"" UNIQUE_DEVICE_NAME "_altitude\",    \"object_id\":\"" UNIQUE_DEVICE_NAME "_altitude\",    \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE1\", \"value_template\":\"{{ value_json.alt     | round(1) }}\", \"device_class\":\"distance\",             \"unit_of_measurement\":\"m\",   \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"
#endif
#define HASSPWMSENSORDISCOVERYTOPIC           "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/pwm/config"
#define HASSPWMSENSORDISCOVERYPAYLOAD         "{\"name\":\"PWM\",         \"unique_id\":\"" UNIQUE_DEVICE_NAME "_PWM\",         \"object_id\":\"" UNIQUE_DEVICE_NAME "_PWM\",         \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE2\", \"value_template\":\"{{ value_json.pwm }}\",                                                                                            \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"
#define HASSRPMSENSORDISCOVERYTOPIC           "homeassistant/sensor/" UNIQUE_DEVICE_NAME "/rpm/config"
#define HASSRPMSENSORDISCOVERYPAYLOAD         "{\"name\":\"RPM\",         \"unique_id\":\"" UNIQUE_DEVICE_NAME "_RPM\",         \"object_id\":\"" UNIQUE_DEVICE_NAME "_RPM\",         \"~\":\"" UNIQUE_DEVICE_NAME "\", \"state_topic\":\"~/tele/STATE2\", \"value_template\":\"{{ value_json.rpm }}\",                                                                                            \"state_class\":\"measurement\", \"expire_after\": \"30\",                                                                                                                                                                                                                                                                                             " HOMEASSISTANTDEVICE "}"

// see https://www.home-assistant.io/integrations/climate.mqtt/#availability_topic
#endif

#endif

// sanity check
#if defined(useMQTT) && !defined(useWIFI)
static_assert(false, "You have to use \"#define useWIFI\" when having \"#define useMQTT\"");
#endif
#if defined(setActualTemperatureViaMQTT) && !defined(useMQTT)
static_assert(false, "You have to use \"#define useMQTT\" when having \"#define setActualTemperatureViaMQTT\"");
#endif

